Project/Toir/src/DataProcessors/торо_ПодборОбъектовРемонтныхРабот/торо_ПодборОбъектовРемонтныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>торо_ПодборОбъектовРемонтныхРабот</name>
</mdclass:DataProcessor>

Project/Toir/src/InformationRegisters/торо_РемонтныеЦиклыОборудования/торо_РемонтныеЦиклыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_РемонтныеЦиклыОборудования</name>
  <resources>
    <name>НеУчитыватьПростоиОборудования</name>
    <comment>Использовать плановую наработка во время простоя (т.е. планировать ТО по наработке во время простоя)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидЦепочки</name>
    <type>
      <types>CatalogRef.торо_ЦепочкиРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаОбъектовРемонтов</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <comment>Организации</comment>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/Catalogs/СтруктураПредприятия/СтруктураПредприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктураПредприятия</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ТекущийРуководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетСтруктуреЮридическихЛиц</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Организация</name>
    <comment>TOIR20-580</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/DataProcessors/торо_ПодборОбъектовРемонтныхРабот/Forms/ФормаПодбораОбъектовИЦепочекДляПланаГрафикаППР/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(КлючНазначенияИспользования) Тогда
		ТекстСообщения = НСтр("es='El tratamiento no es destinado al uso directo.';ru='Обработка не предназначена для непосредственного использования.';en='Processing is not intended for direct use.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("СтруктураИерархии") И ЗначениеЗаполнено(Параметры.СтруктураИерархии) Тогда
		ТекСтруктураИерархии = Параметры.СтруктураИерархии;
	Иначе
		ТекСтруктураИерархии = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиТОиР",
			"ОсновнаяСтруктураИерархии",
			Истина);
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ТекСтруктураИерархии) Тогда
		ТекСтруктураИерархии = Константы.торо_ИерархияДляВводаНовыхОР.Получить();
	КонецЕсли;
	
	// Для основного реквизита формы это свойство установится автоматически,
	// а для дерева сделаем вручную.
	Если Параметры.МножественныйВыбор <> Неопределено Тогда
		Элементы.Дерево.МножественныйВыбор = Параметры.МножественныйВыбор;
		Элементы.ДеревоПолное.МножественныйВыбор = Параметры.МножественныйВыбор;
	КонецЕсли;
	
	ЭтаФорма.ОрганизацияДляОтбора = ?(Параметры.Свойство("Организация"), Параметры.Организация, Справочники.Организации.ПустаяСсылка());
	ЭтаФорма.ПодразделениеДляОтбора = ?(Параметры.Свойство("Подразделение"), Параметры.Подразделение, Справочники.СтруктураПредприятия.ПустаяСсылка());
	ЭтаФорма.НеУчаствуетВПланировании = ?(Параметры.Свойство("НеУчаствуетВПланировании"), Параметры.НеУчаствуетВПланировании, Ложь);
	
	Элементы.ОрганизацияДляОтбора.Видимость = ЗначениеЗаполнено(ЭтаФорма.ОрганизацияДляОтбора);
	Элементы.ПодразделениеДляОтбора.Видимость = ЗначениеЗаполнено(ЭтаФорма.ПодразделениеДляОтбора);
	
	ДополнительныеОтборы = Новый Массив;
	Если ЗначениеЗаполнено(ОрганизацияДляОтбора) Тогда
		СтруктураОтбра = Новый Структура("Ключ, Значение", "Организация", ОрганизацияДляОтбора);
		ДополнительныеОтборы.Добавить(СтруктураОтбра);
	КонецЕсли;
	Если ЗначениеЗаполнено(ПодразделениеДляОтбора) Тогда
		СтруктураОтбра = Новый Структура("Ключ, Значение, ВидСравнения", "Подразделение", ПодразделениеДляОтбора, ВидСравненияКомпоновкиДанных.ВИерархии);
		ДополнительныеОтборы.Добавить(СтруктураОтбра);
	КонецЕсли;
	Если НеУчаствуетВПланировании = Истина Тогда
		СтруктураОтбра = Новый Структура("Ключ, Значение", "НеУчаствуетВПланировании", Ложь);
		ДополнительныеОтборы.Добавить(СтруктураОтбра);
	КонецЕсли;
	
	ФОИспользоватьДокументыЖЦОборудования = ПолучитьФункциональнуюОпцию("торо_ИспользоватьДокументыПринятияИСписанияОборудования");
	ПолучатьСтатусыВУчетеДляДерева = ФОИспользоватьДокументыЖЦОборудования;
	
	Если ФОИспользоватьДокументыЖЦОборудования Тогда
		МассивСтатусов = торо_СтатусыОРВУчете.СписокСтатусовДляПодбора();
		СписокСтатусов.ЗагрузитьЗначения(МассивСтатусов);
	КонецЕсли;
		
	ОбработатьИзменениеИерархииНаСервере();
	
	Если Параметры.Свойство("ЗапретитьИзменениеИерархии") И Параметры.ЗапретитьИзменениеИерархии = Истина Тогда
		Элементы.ФормаНастройкаИерархии.Доступность = Ложь;
	КонецЕсли;
	
	Элементы.СтраницыФормы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	
	ИспользоватьКартинкиТОР = Константы.торо_ИспользоватьКартинкиТиповыхОбъектов.Получить();
	Если ИспользоватьКартинкиТОР Тогда 
		Элементы.Дерево.ПутьКДаннымКартинкиСтроки = "Дерево.КартинкаОтображаемая";
		Элементы.ДеревоПолное.ПутьКДаннымКартинкиСтроки = "ДеревоПолное.КартинкаОтображаемая";
	Иначе 
		Элементы.Дерево.ПутьКДаннымКартинкиСтроки = "Дерево.Картинка";
		Элементы.ДеревоПолное.ПутьКДаннымКартинкиСтроки = "ДеревоПолное.Картинка";
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	торо_РаботаСИерархией20Клиент.УстановитьДоступностьКомандФормы(ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененаПометкаУдаленияОР" Тогда
		торо_РаботаСИерархией20Клиент.ОбработкаОповещенияОбИзмененииПометкиУдаленияОбъектаРемонта(ЭтаФорма, Параметр);
		Если ИспользоватьКартинкиТОР Тогда
			ОбновитьКартинкиЭлементовПолногоДереваНаСервере();
			ОбновитьКартинкиЭлементовДереваНаСервере();
		КонецЕсли; 
	ИначеЕсли ИмяСобытия = "ЗаписанОбъектРемонта" Тогда
		торо_РаботаСИерархией20Клиент.ОбработкаОповещенияОЗаписиОбъектаРемонта(ЭтаФорма, Параметр);
		Если ИспользоватьКартинкиТОР Тогда
			ОбновитьКартинкиЭлементовПолногоДереваНаСервере();
			ОбновитьКартинкиЭлементовДереваНаСервере();
		КонецЕсли; 
	ИначеЕсли ИмяСобытия = "ИзмененПорядокОбъектаРемонта" Тогда
		Если Параметр.СтруктураИерархии = ТекСтруктураИерархии Тогда
			торо_НастройкаПорядкаЭлементовКлиент.ИзменитьПорядокЭлементаВДереве(ЭтаФорма, Параметр);
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ИзмененаСтруктураИерархииОР" Тогда
		Если Параметр = Неопределено ИЛИ Параметр = ТекСтруктураИерархии Тогда
			торо_РаботаСИерархией20Клиент.ОбновитьДеревоИерархии(ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ВыборОбъектаРемонта();	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЦепочки(Команда)
	
	ВыборЦепочки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьНаВидДерева(Команда)
	
	Если ТекущийЭлемент = Элементы.Дерево Тогда
		ТекущиеДанные = Элементы.Дерево.ТекущиеДанные;
	Иначе
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	КонецЕсли;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Ссылка) <> Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если КореньПолногоДерева <> ТекущиеДанные.Ссылка Тогда
		КореньПолногоДерева = ТекущиеДанные.Ссылка;
		торо_РаботаСИерархией20КлиентСервер.ПостроитьДеревоСКонечнымиЭлементами(ДеревоПолное, СтруктураПараметровИерархии, КореньПолногоДерева, ПолучатьСтатусыВУчетеДляДерева, СписокСтатусов, ДополнительныеОтборы);
		СтандартныеПодсистемыКлиент.РазвернутьУзлыДерева(ЭтаФорма, "ДеревоПолное",,Истина);
	КонецЕсли;
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаДеревоПолное;
	
	Если ИспользоватьКартинкиТОР Тогда
		ОбновитьКартинкиЭлементовПолногоДереваНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьНаОбычныйВид(Команда)
	
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаОбычныйВид;
	Если ИспользоватьКартинкиТОР Тогда
		ОбновитьКартинкиЭлементовДереваНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПолноеДерево(Команда)
	
	торо_РаботаСИерархией20КлиентСервер.ПостроитьДеревоСКонечнымиЭлементами(ДеревоПолное, СтруктураПараметровИерархии, КореньПолногоДерева, ПолучатьСтатусыВУчетеДляДерева, СписокСтатусов, ДополнительныеОтборы);
	СтандартныеПодсистемыКлиент.РазвернутьУзлыДерева(ЭтаФорма, "ДеревоПолное",,Истина);
	Если ИспользоватьКартинкиТОР Тогда
		ОбновитьКартинкиЭлементовПолногоДереваНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокЦепочек

&НаКлиенте
Процедура СписокЦепочекПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.СписокЦепочек.ТекущиеДанные;
	ВидЦепочки = ?(ТекущиеДанные = Неопределено, ПредопределенноеЗначение("Справочник.торо_ЦепочкиРемонта.ПустаяСсылка"), ТекущиеДанные.ВидЦепочки);
	УстановитьОтборНаВидыРемонта(ВидЦепочки);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЦепочекВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыборЦепочки();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДерево

&НаКлиенте
Процедура ДеревоПриАктивизацииСтроки(Элемент)
	
	торо_РаботаСИерархией20Клиент.УправлениеОтборомВСписке(ЭтаФорма);
	торо_РаботаСИерархией20Клиент.УстановитьДоступностьКомандДереваПриАктивизацииСтроки(ЭтаФорма, Элемент.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПередРазворачиванием(Элемент, Строка, Отказ)
		
	торо_РаботаСИерархией20Клиент.ДеревоПередРазворачиванием(Дерево, Строка, СтруктураПараметровИерархии, ПолучатьСтатусыВУчетеДляДерева, СписокСтатусов, ДополнительныеОтборы);
	
	Если ИспользоватьКартинкиТОР Тогда
		ОбновитьКартинкиЭлементовДереваНаСервере(Строка);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПередНачаломИзменения(Элемент, Отказ)
	
	торо_РаботаСИерархией20Клиент.ПередНачаломИзменения(Элемент, Отказ, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыборОбъектаРемонта();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПолноеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыборОбъектаРемонта();

КонецПроцедуры

&НаКлиенте
Процедура ДеревоПолноеПриАктивизацииСтроки(Элемент)
	
	ОбъектРемонта = Неопределено;
	ТиповойОР = Неопределено;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ТипЗнч(ТекущиеДанные.Ссылка) = Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда
		ОбъектРемонта = ТекущиеДанные.Ссылка;
		ТиповойОР = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектРемонта, "ТиповойОР");
	КонецЕсли;
	
	УстановитьОтборНаВидыЦепочек(ОбъектРемонта, ТиповойОР);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ОбъектРемонта = Неопределено;
	ТиповойОР = Неопределено;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		торо_РаботаСИерархией20Клиент.ВыделитьРодителяВДереве(ЭтаФорма, ТекущиеДанные);
		ОбъектРемонта = ТекущиеДанные.Ссылка;
		ТиповойОР = ТекущиеДанные.ТиповойОР;
	КонецЕсли;
	
	торо_РаботаСИерархией20Клиент.УстановитьДоступностьКомандСпискаПриАктивизацииСтроки(ЭтаФорма, Элемент.ТекущиеДанные);
	
	УстановитьОтборНаВидыЦепочек(ОбъектРемонта, ТиповойОР);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	торо_РаботаСИерархией20Клиент.ПередНачаломИзменения(Элемент, Отказ, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	торо_РаботаСИерархией20Клиент.СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка, ЭтаФорма);
	
	// Если кликнули не на элемент с подчиненными, то СтандартнаяОбработка сброшена не будет,
	// и можно реализовывать выбор элемента.
	Если СтандартнаяОбработка Тогда
		СтандартнаяОбработка = Ложь;
		ВыборОбъектаРемонта();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	ИспользоватьКартинкиТОР = Константы.торо_ИспользоватьКартинкиТиповыхОбъектов.Получить();
	торо_РаботаСИерархией20.СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки, ИспользоватьКартинкиТОР);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьОтборНаВидыЦепочек(ОбъектРемонта, ТиповойОР)
	
	МассивСсылок = Новый Массив;
	МассивСсылок.Добавить(ОбъектРемонта);
	Если ЗначениеЗаполнено(ОбъектРемонта) Тогда
		МассивСсылок.Добавить(ТиповойОР);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокЦепочек, "ГруппаОбъектовРемонтов", МассивСсылок,,,Истина,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	СписокЦепочекПриАктивизацииСтроки(Элементы.СписокЦепочек);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборНаВидыРемонта(ВидЦепочки)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокВидовРемонта, "ЦепочкаРемонта", ВидЦепочки,,,Истина,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
КонецПроцедуры

// Оповещение о закрытии, вызывается при выполнении команды "Настройка иерархии".
&НаКлиенте
Процедура НастройкаИерархииЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		ТекСтруктураИерархии = ВыбранноеЗначение.СтруктураИерархии;
		ОбработатьИзменениеИерархииНаСервере();
		торо_РаботаСИерархией20Клиент.ОбработатьИзменениеИерархииНаКлиенте(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеИерархииНаСервере()
	
	торо_РаботаСИерархией20.ОбработатьИзменениеИерархииНаСервере(ЭтаФорма, Список, Дерево, ФОИспользоватьДокументыЖЦОборудования, СписокСтатусов,,ДополнительныеОтборы);
	
	КореньПолногоДерева = Неопределено;
	ДеревоПолное.ПолучитьЭлементы().Очистить();
	
	Если ИспользоватьКартинкиТОР Тогда
		ОбновитьКартинкиЭлементовДереваНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборОбъектаРемонта()
	
	Если Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаОбычныйВид Тогда
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Иначе
		ТекущиеДанные = Элементы.ДеревоПолное.ТекущиеДанные;
	КонецЕсли;
	
	Если ТекущиеДанные = Неопределено ИЛИ ТипЗнч(ТекущиеДанные.Ссылка) <> Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныйОбъектРемонта = ТекущиеДанные.Ссылка;
	
	МассивЦепочек = ПолучитьВидыЦепочекНаСервере(ВыбранныйОбъектРемонта);
	
	Если МассивЦепочек.Количество() = 0 Тогда
		ШаблонСообщения = НСтр("es='Para el objeto de la reparación ""%1"" no hay cadenitas de las reparaciones.';ru='Для объекта ремонта ""%1"" нет цепочек ремонтов.';en=""There are no repair chains for repair object '%1'.""");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ВыбранныйОбъектРемонта);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;	
	КонецЕсли;
		
	СписокЦепочекДляВыбора = Новый СписокЗначений;
	СписокЦепочекДляВыбора.ЗагрузитьЗначения(МассивЦепочек);
	Для Каждого СтрокаПометки Из СписокЦепочекДляВыбора Цикл
		СтрокаПометки.Пометка = Истина;
	КонецЦикла;
	
	ДопПараметры =  Новый Структура("ВыбранныйОбъектРемонта", ВыбранныйОбъектРемонта);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборОбъектаРемонтаЗавершение", ЭтотОбъект, ДопПараметры);
	СписокЦепочекДляВыбора.ПоказатьОтметкуЭлементов(ОписаниеОповещения, НСтр("es='La elección de las cadenitas de la reparación';ru='Выбор цепочек ремонта';en='Choice of repair chains'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборОбъектаРемонтаЗавершение(СписокЦепочекДляВыбора, ДополнительныеПараметры) Экспорт
	
	Если СписокЦепочекДляВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныйОбъектРемонта = ДополнительныеПараметры.ВыбранныйОбъектРемонта;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ОбъектРемонта", ВыбранныйОбъектРемонта);
	
	МассивЦепочек = Новый Массив;
	Для Каждого ЭлементСписка Из СписокЦепочекДляВыбора Цикл
		Если ЭлементСписка.Пометка Тогда
			МассивЦепочек.Добавить(ЭлементСписка.Значение);
		КонецЕсли; 
	КонецЦикла;
	
	СтруктураВозврата.Вставить("МассивЦепочек", МассивЦепочек);
	ОповеститьОВыборе(СтруктураВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборЦепочки()
	
	ВыделенныеСтроки = Элементы.СписокЦепочек.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаОбычныйВид Тогда
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Иначе
		ТекущиеДанные = Элементы.ДеревоПолное.ТекущиеДанные;
	КонецЕсли;
	
	Если ТекущиеДанные = Неопределено ИЛИ ТипЗнч(ТекущиеДанные.Ссылка) <> Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныйОбъектРемонта = ТекущиеДанные.Ссылка;

	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ОбъектРемонта", ВыбранныйОбъектРемонта);
	
	МассивЦепочек = Новый Массив;
	Для каждого Строка Из ВыделенныеСтроки Цикл
		ДанныеСтроки = Элементы.СписокЦепочек.ДанныеСтроки(Строка);
		МассивЦепочек.Добавить(ДанныеСтроки.ВидЦепочки);
	КонецЦикла;	
	
	СтруктураВозврата.Вставить("МассивЦепочек", МассивЦепочек);
	ОповеститьОВыборе(СтруктураВозврата);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидыЦепочекНаСервере(ОбъектРемонта)
	
	СписокОтбора = Новый СписокЗначений;
	СписокОтбора.Добавить(ОбъектРемонта);
	СписокОтбора.Добавить(ОбъектРемонта.ТиповойОР);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_РемонтныеЦиклыОборудования.ВидЦепочки,
	|	торо_РемонтныеЦиклыОборудования.ГруппаОбъектовРемонтов
	|ИЗ
	|	РегистрСведений.торо_РемонтныеЦиклыОборудования КАК торо_РемонтныеЦиклыОборудования
	|ГДЕ
	|	торо_РемонтныеЦиклыОборудования.ГруппаОбъектовРемонтов В (&СписокОтбора)";
	
	Запрос.УстановитьПараметр("СписокОтбора", СписокОтбора);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	МассивЦепочек = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		МассивЦепочек.Добавить(Выборка.ВидЦепочки);
	КонецЦикла;
	
	Возврат МассивЦепочек;
	
КонецФункции

&НаСервере 
Процедура ОбновитьКартинкиЭлементовПолногоДереваНаСервере()
	торо_РаботаСИерархией20.ОбновитьКартинкиЭлементовПолногоДереваНаСервере(ДеревоПолное);
КонецПроцедуры

&НаСервере 
Процедура ОбновитьКартинкиЭлементовДереваНаСервере(ИдентификаторСтроки = 0)
	торо_РаботаСИерархией20.ОбновитьКартинкиЭлементовДереваНаСервере(Дерево, ИдентификаторСтроки);
КонецПроцедуры

#КонецОбласти
